# ReverseIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeCreaseArray..::..ReverseIterator Method
SlabShapeCreaseArray Class See Also
---
Retrieve a backward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual SlabShapeCreaseArrayIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As SlabShapeCreaseArrayIterator
```

Visual C++
---
```text
public:
virtual SlabShapeCreaseArrayIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the array.
# See Also
SlabShapeCreaseArray Class
Autodesk.Revit.DB Namespace